PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/waverecorder.c
}

/**
  * @brief  Manages the DMA Half Transfer complete interrupt.
  * @param  None
  * @retval None
  */
void BSP_AUDIO_IN_HalfTransfer_CallBack(void)
{ 
  BufferCtlRecIn.pcm_ptr+= AUDIO_OUT_BUFFER_SIZE/2;
  if(BufferCtlRecIn.pcm_ptr == AUDIO_OUT_BUFFER_SIZE/2)
  {
    BufferCtlRecIn.wr_state   =  BUFFER_FULL;
    BufferCtlRecIn.offset  = 0;
  }
  
  if(BufferCtlRecIn.pcm_ptr >= AUDIO_OUT_BUFFER_SIZE)
  {
    BufferCtlRecIn.wr_state   =  BUFFER_FULL;
    BufferCtlRecIn.offset  = AUDIO_OUT_BUFFER_SIZE/2;    
    BufferCtlRecIn.pcm_ptr = 0;
  }




  
}

/*******************************************************************************
                            Static Functions
*******************************************************************************/

/**
  * @brief  Encoder initialization.
  * @param  Freq: Sampling frequency.
  * @param  pHeader: Pointer to the WAV file header to be written.  
  * @retval 0 if success, !0 else.
  */
static uint32_t WavProcess_EncInit(uint32_t Freq, uint8_t *pHeader)
{  
  
  return 0;
}

/**
  * @brief  Initialize the wave header file
  * @param  pHeader: Header Buffer to be filled
  * @param  pWaveFormatStruct: Pointer to the wave structure to be filled.
  * @retval 0 if passed, !0 if failed.
  */
static uint32_t WavProcess_HeaderInit(uint8_t* pHeader, WAVE_FormatTypeDef* pWaveFormatStruct)
{
  
  /* Return 0 if all operations are OK */
  return 0;
}

/**
  * @brief  Initialize the wave header file
  * @param  pHeader: Header Buffer to be filled
  * @param  pWaveFormatStruct: Pointer to the wave structure to be filled.
  * @retval 0 if passed, !0 if failed.
  */
static uint32_t WavProcess_HeaderUpdate(uint8_t* pHeader, WAVE_FormatTypeDef* pWaveFormatStruct)
{
  /* Write the file length ---------------------------------------------------*/
  /* The sampling time: this value will be written back at the end of the 
     recording operation.  Example: 661500 Btyes = 0x000A17FC, byte[7]=0x00, byte[4]=0xFC */
  pHeader[4] = (uint8_t)(BufferCtlRecIn.fptr);
  pHeader[5] = (uint8_t)(BufferCtlRecIn.fptr >> 8);
  pHeader[6] = (uint8_t)(BufferCtlRecIn.fptr >> 16);
  pHeader[7] = (uint8_t)(BufferCtlRecIn.fptr >> 24);
  /* Write the number of sample data -----------------------------------------*/
  /* This variable will be written back at the end of the recording operation */
  BufferCtlRecIn.fptr -=44;
  pHeader[40] = (uint8_t)(BufferCtlRecIn.fptr); 
  pHeader[41] = (uint8_t)(BufferCtlRecIn.fptr >> 8);
  pHeader[42] = (uint8_t)(BufferCtlRecIn.fptr >> 16);
  pHeader[43] = (uint8_t)(BufferCtlRecIn.fptr >> 24); 
  
  /* Return 0 if all operations are OK */
  return 0;
}





/* sop1hc */
void Audio_Streaming_Ini(void)
{


    /*------------------------PLAYER------------------------------------------------------*/
	/*Adjust the Audio frequency */
    PlayerIni(I2S_AUDIOFREQ_11K);//WaveFormat.SampleRate DEFAULT_AUDIO_IN_FREQ

    BSP_AUDIO_OUT_Play((uint16_t*)&Buffer1.pcm_buff[0], 2*AUDIO_OUT_BUFFER_SIZE);//2*AUDIO_OUT_BUFFER_SIZE

	//BSP_LCD_DisplayStringAt(250, LINE(20), (uint8_t *)"  [PLAY ]", LEFT_MODE);
	///AudioState = AUDIO_STATE_PLAY;

	//HAL_Delay(1000);

    /*----------------------RECORDER-------------------------------------------------------*/	
    /* Initial for microphone's data reading */
    //BSP_AUDIO_IN_Init(INPUT_DEVICE_DIGITAL_MICROPHONE_2, uwVolume, DEFAULT_AUDIO_IN_FREQ); 

    /* Record process*/
    //BSP_AUDIO_IN_Record((uint16_t*)&Buffer1.pcm_buff[0], AUDIO_OUT_BUFFER_SIZE); //8192	

	//BufferCtlRecIn.wr_state = BUFFER_EMPTY;
        
	/*-----------------------------------------------------------------------------------*/







	/*----------------------------------STATE MACHINE CONTROL----------------------------*/
	/* Streaming state */
    AudioDemo.state =  AUDI0_DEMO_STREAMING;
	appli_state = APPLICATION_READY;


	/*------------------------------------------------------------------------------------*/

	
}

void Audio_Streaming(void)
{


	/*------------------------------------------------------------------------------------------*/

	/*-----------------------------PLAY FROM SAI------------------------------------------------*/

	if(BufferCtlPlayOut.state == BUFFER_OFFSET_HALF)
    {

		 BufferCtlPlayOut.state = BUFFER_OFFSET_NONE;

		 //BSP_LCD_DisplayStringAtLine(18,(uint8_t *)BufferCtlPlayOut.buff);
		 if (cntTransFinish==0)
		 {
		     I2S_Init();
			 cntTransFinish = 1;
		 }
	
	}

	if(BufferCtlPlayOut.state == BUFFER_OFFSET_FULL)
    {
         /* copy from Buffer1 to BufferCtlPlayOut */
         //memcpy(&BufferCtlPlayOut.buff[0],&Buffer1.pcm_buff[0],2*AUDIO_OUT_BUFFER_SIZE);
		 BufferCtlPlayOut.state = BUFFER_OFFSET_NONE;



         		/*Adjust the Audio frequency */
         //PlayerIni(DEFAULT_AUDIO_IN_FREQ);//WaveFormat.SampleRate
				 /* Record process*/
         //BSP_AUDIO_IN_Record((uint16_t*)&BufferCtlRecIn.pcm_buff[0], AUDIO_OUT_BUFFER_SIZE);    
		 //BSP_LCD_DisplayStringAtLine(19,(uint8_t *)BufferCtlPlayOut.buff);
	
	}

	/* -------------------------------------------------------------------------------------------*/
	
	
}


void SPI1_Ini(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

 
   	 
  /* Enable SCK, MOSI and MISO GPIO clocks */
  __HAL_RCC_SPI1_CLK_ENABLE();
  __HAL_RCC_GPIOA_CLK_ENABLE();

  
  GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStructure.Pull  = GPIO_PULLDOWN;
  GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;

  /* SPI SCK pin configuration */
  GPIO_InitStructure.Alternate = SPI1_SCK_AF;
  GPIO_InitStructure.Pin = SPI1_SCK_PIN;
  HAL_GPIO_Init(SPI1_SCK_GPIO_PORT,&GPIO_InitStructure);

  /* SPI  MOSI pin configuration */
  GPIO_InitStructure.Alternate = SPI1_MOSI_SOURCE;
  GPIO_InitStructure.Pin =  SPI1_MOSI_PIN;
  HAL_GPIO_Init(SPI1_MOSI_GPIO_PORT, &GPIO_InitStructure);

  /* SPI MISO pin configuration */
  GPIO_InitStructure.Alternate = SPI1_MISO_SOURCE;
  GPIO_InitStructure.Pin = SPI1_MISO_PIN;
  HAL_GPIO_Init(SPI1_MISO_GPIO_PORT, &GPIO_InitStructure);

  /* SPI configuration -------------------------------------------------------*/
  //SPI_I2S_DeInit(SPI1);
  
  spi1_ins.Init.Direction = SPI_DIRECTION_2LINES_RXONLY;
  spi1_ins.Init.DataSize = SPI_DATASIZE_16BIT;
  spi1_ins.Init.CLKPolarity = SPI_POLARITY_LOW;
  spi1_ins.Init.CLKPhase = SPI_PHASE_1EDGE;
  spi1_ins.Init.NSS = SPI_NSS_SOFT;
  spi1_ins.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_64;
  spi1_ins.Init.FirstBit = SPI_FIRSTBIT_MSB;
  spi1_ins.Init.CRCPolynomial = 7;
  spi1_ins.Init.Mode = SPI_MODE_SLAVE;
  if(HAL_SPI_Init(&spi1_ins) != HAL_OK)
  {
    /* Initialization Error */
    //Error_Handler();
  }
  
 
